print("""Выберите вариант фигуры, который вы хотите увидеть на экране.
*********      *              *********                      *********
 ********      **              *******                        *******
  *******      ***              *****                          *****
   ******      ****              ***                            ***
    *****      *****              *               *              *
     ****      ******                            ***            ***
      ***      *******                          *****          *****
       **      ********                        *******        *******
        *      *********                      *********      *********
   (а)            (б)            (в)             (г)            (д)        \n
*       *      *                      *       *********              *
**     **      **                    **       ********              **
***   ***      ***                  ***       *******              ***
**** ****      ****                ****       ******              ****
*********      *****              *****       *****              *****
**** ****      ****                ****       ****              ******
***   ***      ***                  ***       ***              *******
**     **      **                    **       **              ********
*       *      *                      *       *              *********
   (е)            (ж)            (з)             (и)            (к)
""")
bykva = input("Введите букву фигуры: ")
def figura(bykva):
    if bykva == "а":
        for i in range(0, 9):
            print(" " * (0 + i) + "*" * (9-i))
    if bykva == "б":
        for i in range(1, 10):
            print("*" * i)
    if bykva == "в":
        for i in range(9, 1, -1):
            print(" " * (9 - i) + "*" * (2 * i - 9))
    if bykva == "г":
        for i in range(1, 10):
            if i < 5:
                print(" ")
            else:
                print(" " * (9 - i) + "*" * (2 * i - 9))
    if bykva == "д":
        for i in range(0, 9):
            if i < 4:
                print(" " * i + "*" * (9 - i * 2))
            else:
                print(" " * (8 - i) + "*" * (2 * i - 7))
    if bykva == "е":
        for i in range(1, 10):
            if i < 5:
                print("*" * i + " " * (9 - i * 2) + "*" * i)
            elif i == 5:
                print("*" * 9)
            else:
                print("*" * (10 - i) + " " * (i * 2 - 11) + "*" * (10 - i))
    if bykva == "ж":
        for i in range(0, 9):
            if i < 4:
                print("*" * (1 + i))
            else:
                print("*" * (9 - i))
    if bykva == "з":
        for i in range(0, 9):
            if i < 5:
                print(" " * (8 - i) + "*" * (1 + i))
            else:
                print(" " * (i) + "*" * (9 - i))
    if bykva == "и":
        for i in range(0, 9):
            print("*" * (9 - i))
    if bykva == "к":
        for i in range(1, 10):
            print(" " * (10 - i) + "*" * i)
figura(bykva)