# print("""Выберите вариант фигуры, который вы хотите увидеть на экране.
# *********      *              *********                      *********
#  ********      **              *******                        *******
#   *******      ***              *****                          *****
#    ******      ****              ***                            ***
#     *****      *****              *               *              *
#      ****      ******                            ***            ***
#       ***      *******                          *****          *****
#        **      ********                        *******        *******
#         *      *********                      *********      *********
#    (а)            (б)            (в)             (г)            (д)        \n
# *       *      *                      *       *********              *
# **     **      **                    **       ********              **
# ***   ***      ***                  ***       *******              ***
# **** ****      ****                ****       ******              ****
# *********      *****              *****       *****              *****
# **** ****      ****                ****       ****              ******
# ***   ***      ***                  ***       ***              *******
# **     **      **                    **       **              ********
# *       *      *                      *       *              *********
#    (е)            (ж)            (з)             (и)            (к)
# """)
# number = input("Фигура: ")
val = 0
def figura(bykva):
    if bykva == "а":
        for i in range(0, 9):
            print(" " * (0 + i) + "*" * (9-i))
    if bykva == "б":
        for i in range(1, 10):
            print("*" * i)
    if bykva == "в":
        for i in range(9, 1, -1):
            print(" " * (9 - i) + "*" * (2 * i - 9))
    if bykva == "г":
        for i in range(1, 10):
            if i < 5:
                print(" ")
            else:
                print(" " * (9 - i) + "*" * (2 * i - 9))
    if bykva == "и":
        for i in range(0, 9):
            print("*" * (9-i))
    if bykva == "к":
        for i in range(1, 10):
            print(" " * (10 - i) + "*" * i)
figura("к")